In [38]:
#Ejercicio1-4

In [1]:
%load_ext sql

//anaconda/lib/python2.7/site-packages/IPython/config.py:13: ShimWarning: The `IPython.config` package has been deprecated. You should import from traitlets.config instead.
  "You should import from traitlets.config instead.", ShimWarning)
//anaconda/lib/python2.7/site-packages/IPython/utils/traitlets.py:5: UserWarning: IPython.utils.traitlets has moved to a top-level traitlets package.
  warn("IPython.utils.traitlets has moved to a top-level traitlets package.")

In [2]:
%sql sqlite:///Ejercicio-1-4--.db

u'Connected: None@Ejercicio-1-4--.db'

In [3]:
%%sql 
DROP TABLE Profesores

Done.

[]

In [4]:
%%sql
CREATE TABLE Profesores
    (nif VARCHAR(10), num_asignatura int NOT NULL, NumCuatrimestre int NOT NULL,
    primary key(nif),
    FOREIGN KEY (num_asignatura) REFERENCES Asignaturas (num_asignatura))

Done.

[]

In [5]:
%%sql INSERT INTO Profesores(nif, num_asignatura, NumCuatrimestre) 
    VALUES ('123458789P', '1', '1')

1 rows affected.

[]

In [6]:
%sql SELECT * FROM Profesores

Done.

[(u'123458789P', 1, 1)]

In [7]:
%%sql
DROP TABLE Asignaturas

Done.

[]

In [8]:
%%sql
CREATE TABLE Asignaturas
    (num_asignatura int NULL, primary key(num_asignatura))

Done.

[]

In [9]:
%%sql INSERT INTO Asignaturas(num_asignatura) 
    VALUES ('2')

1 rows affected.

[]

In [10]:
%sql SELECT * FROM Asignaturas

Done.

[(2,)]

In [11]:
%sql SELECT * FROM ensenar   

#no se hace tabla ense√±ar va dentro de profesores!

(sqlite3.OperationalError) no such table: ensenar [SQL: u'SELECT * FROM ensenar']